### Data cleaning with county_unemployment_rate file

In [1]:
# read unemployment _rate_county.csv file
import pandas as pd
Uemploy_rate_county = pd.read_csv('unemployment _rate_county.csv', index_col = 'Year')

In [2]:
Uemploy_rate_county.info()
Uemploy_rate_county.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 885548 entries, 2015 to 2009
Data columns (total 4 columns):
Month     885548 non-null object
State     885548 non-null object
County    885548 non-null object
Rate      885548 non-null float64
dtypes: float64(1), object(3)
memory usage: 33.8+ MB

         Month        State         County  Rate
Year
2015  February  Mississippi  Newton County   6.1
2015  February  Mississippi  Panola County   9.4
2015  February  Mississippi  Monroe County   7.9
2015  February  Mississippi   Hinds County   6.1
2015  February  Mississippi  Kemper County  10.6

In [3]:
# slice unemployment rate in 2015
Uemploy_rate_county = Uemploy_rate_county.loc[2015, ['County', 'State', 'Rate']]

In [4]:
Uemploy_rate_county.info()
Uemploy_rate_county.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33534 entries, 2015 to 2015
Data columns (total 3 columns):
County    33534 non-null object
State     33534 non-null object
Rate      33534 non-null float64
dtypes: float64(1), object(2)
memory usage: 1.0+ MB

             County        State  Rate
Year
2015  Newton County  Mississippi   6.1
2015  Panola County  Mississippi   9.4
2015  Monroe County  Mississippi   7.9
2015   Hinds County  Mississippi   6.1
2015  Kemper County  Mississippi  10.6

In [5]:
# create a function to get rid of 'county' in the county name
def clean_county(list):
    words = []
    for l in list:
        word = l.split()
        if word[-1] == 'County':
            word.pop()
            l = ''.join(word)
            words.append(l)
        else:
            words.append(l)
    return words

In [6]:
Uemploy_rate_county['county'] = clean_county(Uemploy_rate_county.County)

In [7]:
# get the average unemployment in each county of US in 2015
ave = Uemploy_rate_county.groupby(['State', 'county']).mean()

In [8]:
ave.info()
ave.head()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 2885 entries, (Alabama, Autauga) to (Wyoming, Weston)
Data columns (total 1 columns):
Rate    2885 non-null float64
dtypes: float64(1)
memory usage: 45.2+ KB

                     Rate
State   county
Alabama Autauga  5.250000
        Baldwin  5.491667
        Barbour  8.941667
        Bibb     6.608333
        Blount   5.408333

In [8]:
ave = ave.reset_index()
ave['State'].value_counts().shape

(47,)

In [9]:
# US state abbrevation dictionary
us_state_abbrev = { 'Alabama': 'AL', 'Alaska': 'AK', 'Arizona': 'AZ', 'Arkansas': 'AR', 
                   'California': 'CA', 'Colorado': 'CO', 'Connecticut': 'CT', 'Delaware': 'DE', 
                   'Florida': 'FL', 'Georgia': 'GA', 'Hawaii': 'HI', 'Idaho': 'ID', 'Illinois': 'IL', 
                   'Indiana': 'IN', 'Iowa': 'IA', 'Kansas': 'KS', 'Kentucky': 'KY', 'Louisiana': 'LA', 
                   'Maine': 'ME', 'Maryland': 'MD', 'Massachusetts': 'MA', 'Michigan': 'MI', 
                   'Minnesota': 'MN', 'Mississippi': 'MS', 'Missouri': 'MO', 'Montana': 'MT', 
                   'Nebraska': 'NE', 'Nevada': 'NV', 'New Hampshire': 'NH', 'New Jersey': 'NJ', 
                   'New Mexico': 'NM', 'New York': 'NY', 'North Carolina': 'NC', 'North Dakota': 'ND', 
                   'Ohio': 'OH', 'Oklahoma': 'OK', 'Oregon': 'OR', 'Pennsylvania': 'PA', 'Rhode Island': 'RI', 
                   'South Carolina': 'SC', 'South Dakota': 'SD', 'Tennessee': 'TN', 'Texas': 'TX', 
                   'Utah': 'UT', 'Vermont': 'VT', 'Virginia': 'VA', 'Washington': 'WA', 'West Virginia': 'WV', 
                   'Wisconsin': 'WI', 'Wyoming': 'WY'}

In [10]:
# convert US states to abbrevarion
us_state_abbrev = pd.DataFrame(list(us_state_abbrev.items()), columns=['State full', 'state'])
new1 = pd.merge(left=ave, right=us_state_abbrev, left_on='State', right_on='State full' )

In [11]:
new1.info()
new1.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2885 entries, 0 to 2884
Data columns (total 5 columns):
State         2885 non-null object
county        2885 non-null object
Rate          2885 non-null float64
State full    2885 non-null object
state         2885 non-null object
dtypes: float64(1), object(4)
memory usage: 135.2+ KB

     State   county      Rate State full state
0  Alabama  Autauga  5.250000    Alabama    AL
1  Alabama  Baldwin  5.491667    Alabama    AL
2  Alabama  Barbour  8.941667    Alabama    AL
3  Alabama     Bibb  6.608333    Alabama    AL
4  Alabama   Blount  5.408333    Alabama    AL

In [12]:
unemploy = new1[['state', 'county', 'Rate']]
unemploy['state'].value_counts().shape  # unique states number in unemploy file

(47,)

In [13]:
a = set(unemploy['state'])
b = set(us_state_abbrev['state'])
b-a

{'AK', 'FL', 'GA'}

In [14]:
unemploy.head()

  state   county      Rate
0    AL  Autauga  5.250000
1    AL  Baldwin  5.491667
2    AL  Barbour  8.941667
3    AL     Bibb  6.608333
4    AL   Blount  5.408333

### Data cleaning with county_unemployment_rate of the missing three state file

In [15]:
# add three states' unemployment rate(AK, FL and GA)
Three_states = pd.read_csv('Three_state_unemploy.csv')
Three_states.info()
Three_states.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 255 entries, 0 to 254
Data columns (total 3 columns):
state     255 non-null object
county    255 non-null object
Rate      255 non-null float64
dtypes: float64(1), object(2)
memory usage: 6.1+ KB

  state                      county  Rate
0    AK      Aleutians East Borough   3.2
1    AK  Aleutians West Census Area   3.8
2    AK           Anchorage Borough   5.0
3    AK          Bethel Census Area  14.2
4    AK         Bristol Bay Borough   9.2

In [16]:
# get rid of 'county' from county name
Three_states['county'] = clean_county(Three_states.county)

In [17]:
# get the file containing county unemployment rate in 50 states of US
whole = unemploy.append(Three_states).sort_values('state')
whole = whole.reset_index()
whole.info()
whole.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3140 entries, 0 to 3139
Data columns (total 4 columns):
index     3140 non-null int64
state     3140 non-null object
county    3140 non-null object
Rate      3140 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 98.2+ KB

   index state                           county  Rate
0     23    AK  Southeast Fairbanks Census Area  10.5
1      0    AK           Aleutians East Borough   3.2
2     28    AK        Yukon-Koyukuk Census Area   1.0
3     27    AK                  Yakutat Borough   8.5
4     26    AK            Wrangell Borough/city   7.8

In [18]:
whole = whole[['state', 'county', 'Rate']]

### Data cleaning with zip_code_states file

In [19]:
# read zip_codes_states.csv file
county_zip = pd.read_csv('zip_codes_states.csv')
county_zip.info()
county_zip.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42741 entries, 0 to 42740
Data columns (total 6 columns):
zip_code     42741 non-null int64
latitude     42049 non-null float64
longitude    42049 non-null float64
city         42741 non-null object
state        42741 non-null object
county       42199 non-null object
dtypes: float64(2), int64(1), object(3)
memory usage: 2.0+ MB

   zip_code   latitude  longitude        city state     county
0       501  40.922326 -72.637078  Holtsville    NY    Suffolk
1       544  40.922326 -72.637078  Holtsville    NY    Suffolk
2       601  18.165273 -66.722583    Adjuntas    PR   Adjuntas
3       602  18.393103 -67.180953      Aguada    PR     Aguada
4       603  18.455913 -67.145780   Aguadilla    PR  Aguadilla

In [20]:
# get 'state', 'County', 'zip_code' colunms
county_zip = county_zip[['state', 'county', 'zip_code']]
# change 'zip_code' column to string type
county_zip['zip_code'] = county_zip['zip_code'].astype(str)

In [21]:
# convert zip code to XXX00 type.
def new_zip(df):
    l = []
    for z in df.zip_code:
        if len(z) == 3:
            z = '00' + z[0] + '00'
        elif len(z) == 4:
            z = '0' + z[0:2] + '00'
        else:
            z = z[0:3] + '00'  
        l.append(z)
    df.zip_code = l
    return df

czip = new_zip(county_zip)
czip.head()

  state     county zip_code
0    NY    Suffolk    00500
1    NY    Suffolk    00500
2    PR   Adjuntas    00600
3    PR     Aguada    00600
4    PR  Aguadilla    00600

In [22]:
czip_unique = czip.drop_duplicates()
czip_unique.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5167 entries, 0 to 42739
Data columns (total 3 columns):
state       5167 non-null object
county      5149 non-null object
zip_code    5167 non-null object
dtypes: object(3)
memory usage: 161.5+ KB

In [23]:
czip_unique = czip_unique.reset_index()
czip_unique['state'].value_counts().shape

(62,)

In [24]:
# compare the states in czip_unique with us_state_avvrev
c = set(czip_unique.state)
d = c-b
print(d)

{'GU', 'VI', 'AS', 'MP', 'PR', 'AA', 'FM', 'AE', 'AP', 'DC', 'PW', 'MH'}

In [25]:
# delete territories, associate states and US military in czip_unique file
czip_unique1 = czip_unique.loc[czip_unique['state'].isin(us_state_abbrev.state)]
czip_unique1['state'].value_counts().shape

(50,)

In [26]:
czip_unique1 = czip_unique1. reset_index()
czip_unique1 = czip_unique1[['state', 'county', 'zip_code']]
czip_unique1.head()

  state     county zip_code
0    NY    Suffolk    00500
1    MA    Hampden    01000
2    MA  Hampshire    01000
3    MA  Worcester    01000
4    MA  Berkshire    01000

In [27]:
# find if two tables 'county' name match or not
def county_match(df1, df2):
    unmatch = []
    for s in df1.state:
        f = df1.loc[df1.state == s, 'county']
        g = df2.loc[df2.state == s, 'county']
        f1 = len(set(f) - set(g) & set(f))
        g1 = len(set(g) - set(f) & set(g))
        if f1 > 0 and g1 > 0:
            if f1 != g1:
                unmatch.append(s)
            
    return list(set(unmatch))

In [28]:
unmatch_list = county_match(whole, czip_unique1)
print(unmatch_list)

['AK', 'OH', 'CO', 'VA', 'NC', 'PA']

In [29]:
OH = whole.replace({'county': {'VanWert' : 'Van Wert'}})

In [30]:
VA = OH.replace({'county' : {'Bristol City' : 'Bristol', 'CharlesCity' : 'Charles City', 'IsleofWight' : 'Isle Of Wight',
                    'JamesCity' : 'James City', 'KingGeorge' : 'King George', 'KingWilliam' : 'King William',
                    'KingandQueen' : 'King And Queen', 'NewKent' : 'New Kent', 'PrinceEdward': 'Prince Edward',
                    'PrinceGeorge' : 'Prince George', 'PrinceWilliam' : 'Prince William', 'Radford City' : 'Radford',
                    'Salem City' : 'Salem'}})

In [31]:
NC = VA.replace({'county': {'McDowell' : 'Mcdowell', 'NewHanover' : 'New Hanover'}})

In [32]:
CO = NC.replace({'county' : {'ClearCreek' : 'Clear Creek',
                              'ElPaso' : 'El Paso',
                              'KitCarson' : 'Kit Carson',
                              'LaPlata' : 'La Plata',
                              'LasAnimas' : 'Las Animas',
                              'RioBlanco' : 'Rio Blanco',
                              'RioGrande' : 'Rio Grande',
                              'SanJuan' : 'San Juan',
                              'SanMiguel' : 'San Miguel'}})

In [33]:
PA = CO.replace({'county' : {'McKean' : 'Mckean'}})

In [34]:
AK = PA.replace({'county' : {'Aleutians East Borough' : 'Aleutians East', 'Aleutians West Census Area' : 'Aleutians West',
'Anchorage Borough': 'Anchorage', 'Bethel Census Area': 'Bethel','Bristol Bay Borough': 'Bristol Bay',
'Denali Borough' : 'Denali' ,'Dillingham Census Area': 'Dillingham','Fairbanks North Star Borough':'Fairbanks North Star',
'Haines Borough':'Haines', 'Juneau Borough': 'Juneau', 'Kenai Peninsula Borough':'Kenai Peninsula' ,
'Ketchikan Gateway Borough':'Ketchikan Gateway' , 'Kodiak Island Borough':'Kodiak Island','Lake and Peninsula Borough':'Lake And Peninsula',
'Matanuska-Susitna Borough': 'Matanuska Susitna', 'Nome Census Area':'Nome','North Slope Borough':'North Slope', 
'Northwest Arctic Borough':'Northwest Arctic', 'Prince of Wales-Hyder Census Area':'Prince Wales Ketchikan',
'Sitka Borough': 'Sitka', 'Skagway Municipality': 'Skagway Hoonah Angoon',
'Southeast Fairbanks Census Area': 'Southeast Fairbanks', 'Valdez-Cordova Census Area': 'Valdez Cordova',
'Wade Hampton Census Area': 'Wade Hampton', 'Wrangell Borough/city': 'Wrangell Petersburg' ,
'Yakutat Borough': 'Yakutat', 'Yukon-Koyukuk Census Area':'Yukon Koyukuk'}})

In [35]:
# test the unmathed state again
unmatch_list1 = county_match(AK, czip_unique1)
print(unmatch_list1)

[]

### concate unemployment_county file with county_zipcode file

In [36]:
unemploy_zip1 = pd.merge(czip_unique1, AK, on=['state','county'],how='inner')

In [37]:
unemploy_zip1.info()
unemploy_zip1.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4679 entries, 0 to 4678
Data columns (total 4 columns):
state       4679 non-null object
county      4679 non-null object
zip_code    4679 non-null object
Rate        4679 non-null float64
dtypes: float64(1), object(3)
memory usage: 182.8+ KB

  state   county zip_code      Rate
0    NY  Suffolk    00500  4.808333
1    NY  Suffolk    06300  4.808333
2    NY  Suffolk    11700  4.808333
3    NY  Suffolk    11800  4.808333
4    NY  Suffolk    11900  4.808333

In [38]:
import csv
unemploy_zip1.to_csv('Unemploy_zip1.csv', sep=',',  encoding='utf-8')